---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModule.MacroLanguageType
source: html/e932dcf6-8966-3733-d951-082396590d5e.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.MacroLanguageType Property

The Macro language type.

## Syntax (C#)
```csharp
public MacroLanguageType MacroLanguageType { get; }
```